function myFunction() {
      let z, message;
      z = document.getElementById("name").value;
      if(z){
            document.getElementById("result").style.display = "block";
            if( z == "الدوري السعودي" || z == "دوري روشن" || z == "الدوري") {
                  message = "الهلال لديه 19 لقب دوري وهو اكثر نادي سعودي تحقيق للدوري";
            }
            else if( z == "كأس الملك" || z == "كاس الملك" || z == "كأس خادم الحرمين الشريفين" || z == "كاس خادم الحرمين الشريفين") {
                  message = "الهلال لديه 11 لقب";
            }
            else if( z == "كأس ولي العهد" || z == "كاس ولي العهد") {
                  message = " الهلال لديه 13 لقب وهو اكثر نادي تحقيقا لهذه البطولة";
            }
            else if( z == "كأس الامير فيصل بن فهد" || z == "كأس الاتحاد السعودي" || z == "كاس الاتحاد السعودي" || z == "كاس الامير فيصل بن فهد") {
                  message = "الهلال لديه 6 القاب";
            }
            else if( z == "كأس المؤسس" || z == "كاس المؤسس") {
                  message = "الهلال لديه لقب واحد وهو النادي الوحيد الذي حقق هذه البطولة";
            }
            else if( z == " كأس السوبر السعودي" || z == "السوبر السعودي" || z == "كاس السوبر السعودي") {
                  message = "الهال لديه 5 القاب سوبر وهو النادي الاكثر تحقيق للقب السوبر ";
            }
            else if( z == "دوري ابطال العرب") {
                  message = "الهلال لديه لقبان";
            }
            else if( z == "كأس الكؤوس العربية" || z == "كاس الكؤوس العربية") {
                  message = "الهلال لديه لقب واحد";
            }
            else if( z == "كأس السوبر العربي" || z == "كاس السوبر العربي") {
                  message = "الهلال لديه لقب واحد";
            }
            else if( z == "كأس الخليج العربي" || z == "كاس الخليج العربي") {
                  message = "الهلال لديه لقبان";
            }
            else if( z == "كأس السوبر السعودي المصري" || z == "كاس السوبر السعودي المصري") {
                  message = "الهلال لديه لقب واحد";
            }
            else if( z == "دوري ابطال اسيا" || z == "دوري ابطال اسيا للنخبة" || z == "ابطال اسيا") {
                  message = "حقق الهلال البطولة 4 مرات بجميع المسميات وهو الاكثر تحقيقا لها ولديه بالمجمل 8 القاب اسيوية";
            }
            else if( z == "كأس الكؤوس الاسيوية" || z == "كاس الكؤوس الاسيوية" ) {
                  message = "الهلال لديه لقبان وهو الاكثر تحقيق للبطولة في القارة";
            }
            else if( z == "كأس السوبر الاسيوي" || z == "كاس السوبر الاسيوي" || z == "السوبر الاسيوي") {
                  message = "الهلال لديه لقبان وهو اكثر من حقق البطولة في القارة";
            }
            else {
                  message = "البطولة لم يحققها الهلال / ما تم ادخالة خاطئ";
            }
            document.getElementById("msg").innerHTML = message;
      }
      else{
            alert("الرجاء ادخال اسم البطولة");
      }
}
function exit() {
      let x = document.getElementById("icon");
      let y = document.getElementById("result");
      y.style.display = "none";
}